{
    "9955ea6a996842568cce56fbcc9132c5": {
        "title": "Claim & delegate $SAFE",
        "url": "/GC33/JBP-271.md",
        "type": "",
        "status": "Voting",
        "proposalId": "JBP-271",
        "discussionThreadURL": "https://discord.com/channels/775859454780244028/873248745771372584/1025558290056355881",
        "ipfsURL": "https://gateway.pinata.cloud/ipfs/QmYnw4HoG7fQt7cdGfkNVcy5GXuaRrwhDNCM68eTdUzEEp",
        "voteURL": "https://snapshot.org/#/jbdao.eth/proposal/0x70139ecb9986d627e12d4fd91eb3226a31b7b6db83340047c0753defca722ea0",
        "date": "2022-09-29",
        "governanceCycle": 33,
        "voteSetup": {
            "choices": [
                ""
            ]
        },
        "body": "# JBP-271 - Claim & delegate $SAFE\n```plain text\nAuthor: Dr. Gorilla\nDate: 2022-09-29\n```\n\n## Synopsis\n\nClaim the $SAFE token (the governance token of Safe, prev Gnosis Safe) from the multisig & delegate the voting power to a JuiceboxDAO contributor\n\n## Motivation\n\nThe airdrop is claimable until the 27th December 2022 and consist of 2 parts: 3817.86 imediately redeemed and 3817.3 vested over the 4 next years.\n\nWhile the future value of $SAFE is unknown, the governance role it entails is key for the ecosystem. This airdrop would then be used to vote on future governance process. To avoid multisig burden, the voting power would be delegated, while claiming, to [0xBA5ED](https://www.notion.so/4f50b0a2c585420ea3b4a373b152dad2) (who’s already a registered delegate).\n\n## Specification\n\nUsing the $SAFE claiming app in the multisig, claim the first airdrop part and delegate the whole voting power to 0xBA5ED\n\n## Rationale\n\nClaiming an airdrop has one financial and two non-financial costs:\n\n- Financial: gas used, which should be less than the potential airdrop gross value (important to note the airdrop is non-transferable for an initial period, the $safe balance would therefore be stuck in the multisig).\n\n- Non-financial:\n\n\t- Adding a risk: it is a contract interaction, with the multiple vectors it implies. Doing so from the Safe frontend, via the built-in official app is a way to reduce the attack surface (ie similar to every interaction we do every FC)\n\n\t- Voting burden: reading proposals, debating, forming one own opinion on various topic, for such an important tool, is time- and mental ressources-consuming. It therefore requires some type of giga-brain as 0xBA5ED is. \n\n## Risks\n\nsmall operational/contract risk (care must be taken for every contract interaction arising from the multisig, regardless of the target)\n\n“voting power risk” as 0xBA5ED would be the only representative. This should be discussed during temp check, as multiple delegate is an option to mitigate this risk, or a governing process might be built if the DAO wants to express a vote for every Safe proposals (a delegation system should still be kept, as to not clog the Dao Safe multisig).\n\n## Timeline\n\nasap\n"
    },
    "6bb92c83571245949ecf1e495793e66b": {
        "title": "Fund the NFT Rewards Smart Contract Audit",
        "url": "/GC33/JBP-272.md",
        "type": "Payout",
        "status": "Voting",
        "proposalId": "JBP-272",
        "discussionThreadURL": "https://discord.com/channels/775859454780244028/873248745771372584/1026966074907951144",
        "ipfsURL": "https://gateway.pinata.cloud/ipfs/QmPNynXqw4mAea35eQpGW9EgduN9PFc1MX89vtr33eypWh",
        "voteURL": "https://snapshot.org/#/jbdao.eth/proposal/0x4e18c39548b34c2f04ef3e7c012b4021fd85d518d4c5243b311ea530bed7a433",
        "date": "2022-10-04",
        "governanceCycle": 33,
        "voteSetup": {
            "choices": [
                ""
            ]
        },
        "body": "# JBP-272 - Fund the NFT Rewards Smart Contract Audit\nStatus: Discussion\n\n```plain text\nAuthor: Nicholas\nDate: (2022-10-04)\n```\n\n## Synopsis\n\nSend $73.8k worth of ETH to the [NFT Rewards Audit Fund](https://juicebox.money/@auditfund) Juicebox project, which is fundraising for a Code4rena audit of the NFT Rewards Contracts that will cost $72k, plus 2.5% in JB fees, for a total of $73.8k. \n\nFund a JBX distribution of 3 million JBX to be divided between donors to the Audit Fund before the fundraising deadline (approx. Oct 17).  \n\nThis proposal would also serve as a pilot integration of Juicebox and Code4rena, who have asked how they might use Juicebox Protocol to allow anyone to fundraise for C4A smart contract audits.\n\n## Motivation\n\nThe NFT Rewards contracts are complex and deeply integrated with the Juicebox Protocol's various affordance, allowing features such as tiered NFT rewards, NFTs that are a claim on overflow, and NFT governance tokens that can directly control Juicebox projects in onchain governance. While NFT Rewards are only attached to a given JBP Funding Cycle, it would be best if the contracts are free of bugs and vulnerabilities.\n\nIn recent weeks, C4A reached out to Nicholas to ask how they could use JBP to permissionlessly create fundraising pools for any protocol or smart contract on Ethereum. Their goal is to enable anyone to donate to an audit pool, which can be spent on C4A code contests. They have observed that many DAOs want to audit each other for technical dependency vigilance. Individual stakeholders, users, and observers of smart contracts may also want to pitch in to fund an audit, without supporting the whole cost of the audits alone.\n\nThis proposal is part of a pilot project to move this integration partnership forward via measured experimentation on mainnet. The [NFT Rewards Audit Fund](https://juicebox.money/@auditfund) is a JB project raising funds to pay for the NFT Rewards contracts audit. It is accepting donations from the public. The goal is to raise $73.8K, then disperse the funds as DAI to C4A to kick off the NFT Rewards audit contest. If JBDAO supports the present proposal, then it will put $73.8k back into the treasury without generating any new tokens (`addToBalance()`). If this proposal passes, donors to the initial fundraise will be able to redeem their tokens to receive a refund for their original donation — courtesy JBDAO, who will have picked up the bill.\n\nTo kick off the contest on Oct 18, C4A needs to receive the funds by Oct 17. In order to incentivize supporters of the NFT Rewards audit fund in advance of this deadline, if this proposal is approved, JBDAO will distribute 3 million JBX (1.4% of JBDAO’s current JBX position) to donors who pay the project before Oct 17 16:00 UTC. 1 million JBX will be split evenly between wallets that donated within each of the `>0.1 to < 1eth`, `>1eth to <10eth`, and `>10eth` tiers. This incentivizes larger donors who will share the JBX incentive with fewer fellow tier members.\n\nThis experiment allows us to locate and solve roadblocks in the rollout of a JBP x C4A integration partnership. These are being actively documented and discussed in [Discord](https://discord.com/channels/775859454780244028/1024114191419834468). This project will simultaneously get NFT Rewards audited by C4A, the protocol devs' preferred auditing solution of late, AND contribute to a genuine experiment that pushes partnership discussions forward and identifies and creates solutions to problems along the way. For instance, DrGorilla is [writing an allocator](https://github.com/jbx-protocol/juice-extensions-collection/blob/4f54fdcb47a8e8c152c4970af0c2fcf07dff10b5/contracts/Allocator/example/swapAllocator/SwapAllocator.sol), which will allow any JB Project to do payouts in DAI, because C4A requires that contests be funded in stablecoins. Note: This particular feature may or may not ship in time for the NFT Rewards audit.\n\n## Specification\n\nPay $73.8k from JBDAO v1 to 0x6052faf32b26edbbcfadb5527654e458fe7c0e35 (v2/256 project payer that does not mint tokens)\n\nSend 3 million JBX from the multisig to safe.auditfund.eth. Nicholas, Jango, and the JB multisig will coordinate to make the tokens available to eligible addresses according to the donation tiers described above.\n\n## Rationale\n\nThis is a project payer address that points funds at @auditfund (v2 project 256) without minting any new tokens. This will allow the v1 JBDAO treasury to pay the v2 @auditfund.\n\n## Risks\n\nProject 256 could be misconfigured and the redemption could somehow go not as planned. Partnership talks could also evaporate.\n\n## Timeline\n\nAdded to current cycle payouts on JBDAO v1 and v2.\n"
    },
    "7dec578d23f84cfb8355c0c469389719": {
        "title": "jigglyjams.eth payout renewal",
        "url": "/GC33/JBP-273.md",
        "type": "Payout",
        "status": "Voting",
        "proposalId": "JBP-273",
        "discussionThreadURL": "https://discord.com/channels/775859454780244028/873248745771372584/1027956900106621018",
        "ipfsURL": "https://gateway.pinata.cloud/ipfs/QmaniFgTi1cp18nJ1xokDtfs5znmnFQUJAr35CJZvZR713",
        "voteURL": "https://snapshot.org/#/jbdao.eth/proposal/0x60426f51f27798501c568d53f9fb6f4c062d8a7ee44c0b7d786491c3be0d261e",
        "date": "2022-10-06",
        "governanceCycle": 33,
        "voteSetup": {
            "choices": [
                ""
            ]
        },
        "body": "# JBP-273 - jigglyjams.eth payout renewal\n```plain text\nAuthor: jigglyjams\nDate: 2022-10-06\n```\n\n## Synopsis\n\n_What’s the idea?_\n\nRenew recurring payout to jigglyjams at $5,000 per cycle for 4 cycles (a total of $20,000)\n\n## Motivation\n\n_What problem does this solve? Why now?_ \n\nGovernance automation is essential to the long lasting success of Juicebox. The nance project has made major strides in automating juicebox DAO’s governance but there is still more work to be done. Just in the past few weeks twodam and jigglyjams have been heavily collaborating on building a stand alone tool for juicebox governance (see alpha [https://juicetool.xyz/nance/juicebox](https://juicetool.xyz/nance/juicebox)). This helps clarify to proposal submitters what fields are necessary for proposal submission and helps automate payout proposal configurations.\n\nThe amount of time that high payout members of the DAO are doing low level tedious work is still much too high. Automatic reconfigurations of both the V2 and V3 treasury have been successfully performed by nance, saving a lot of time and headache for multisig members. The configuration of the V1 treasury is still very tedious and must be automated to prevent unintended costly mistakes.\n\n## Specification\n\n_How exactly will this be executed? Be specific and leave no ambiguity._ \n\nAdd jigglyjam’s V2 juicebox project (id: 188) to the funding distribution of juicebox dao’s v2 treasury for the amount of $5,000 in ETH\n\n## Rationale\n\n_Why is this specification appropriate?_\n\nSince jigglyjam’s first recurring payout proposal (JBP-221) the following things have been accomplished:\n\n- Automatic translations of proposals during voting phase using deepl API and storage in GitHub (see [https://github.com/jigglyjams/juicebox-governance/tree/main/GC32/translation/zh](https://github.com/jigglyjams/juicebox-governance/tree/main/GC32/translation/zh))\n\n- Backup of proposals and voting results in GitHub (see [https://github.com/jigglyjams/juicebox-governance/blob/main/DATABASE.md](https://github.com/jigglyjams/juicebox-governance/blob/main/DATABASE.md))\n\n- Adding columns to notion db that support payout routing information\n\n- Automatic Gnosis transaction queuing of payout reconfigurations for JB treasuries V2 & V3 (this saves the multisig signers a lot of time!)\n\n- Many bug fixes and overall tightening of the notion → discord → snapshot flow of information\n\n- **gnance.eth has submitted 86 proposals to snapshot** and many more to discord\n\n- jigglyjams has assisted peeldao by contributing to the juice-sdk’s (see [https://github.com/jbx-protocol/juice-sdk-v3/pull/1](https://github.com/jbx-protocol/juice-sdk-v3/pull/1))\n\n- jigglyjams has assisted in the great herding of the multisig\n\nWith the continuation of jigglyjam’s recurring payout the following tasks are to be accomplished:\n\n- Automatic configuration of V1 treasury - _jigglyjams will collaborate with twodam to make this a great experience for the DAO and multisig members_\n\n- Automatic synchronization of all JB’s juicebox treasuries\n\n- Migrate away from notion - jigglyjams plans to slowly migrate juicebox off of notion as a proposal storage system. A prototype is still in need of building but jigglyjams plans on using dolt (git for sql databases) to version and store the governance database. Initially juicetool will submit proposals to both notion and the new governance storage system, when the new system is fully running and the dao is comfortable with its abilities we will shut off the connections to notion.\n\n- Make nance more accessible to other juicebox projects - the ease that nance provides to juicebox dao will attract other daos to the platform. Accomplishing the task above (migration off of notion) with twodam and juicetool will be a major catalyst to expand to other juicebox projects\n\n- Stats on the number of proposals that have passed through nance\n\n## Risks\n\n_What might go wrong?_\n\njigglyjams may fail to do this job. _Mitigation:_ jigglyjams has been heavily involved over the past 5 months and very much enjoys this work and being apart of JB\n\n## Timeline\n\n_When exactly should this proposal take effect? When exactly should this proposal end?_ \n\nThis proposal shall take effect in the GC#33 reconfiguration and remain until GC#36\n"
    },
    "bd1319c0cdbe4e05b2545be2a5653f76": {
        "title": "Renew Recurring Payout for nnnnicholas",
        "url": "/GC33/JBP-274.md",
        "type": "Recurring Payment",
        "status": "Voting",
        "proposalId": "JBP-274",
        "discussionThreadURL": "https://discord.com/channels/775859454780244028/873248745771372584/1027991642382274650",
        "ipfsURL": "https://gateway.pinata.cloud/ipfs/QmSwtL7XRfKGcSMVKeo876smLXY1oSESsYuzTbj8pNw1e4",
        "voteURL": "https://snapshot.org/#/jbdao.eth/proposal/0x4987d968badec9d7c71075561ab2f810c718ea3246e177304cb9b78254e147f8",
        "date": "2022-10-07",
        "governanceCycle": 33,
        "voteSetup": {
            "choices": [
                ""
            ]
        },
        "body": "# JBP-274 - Renew Recurring Payout for nnnnicholas\n```plain text\nAuthor: nnnnicholas\nDate: 2022-07-01\n```\n\n## Thesis:\n\nRenew Nicholas’s payout (via _dao dev inc._) as a contributor on developer relations, product development, DAO operations, partnerships and communication ending in 7 FCs.\n\n## Abstract:\n\nEngage Nicholas (via an engagement with his company _dao dev inc._) to contribute to the following JuiceboxDAO initiatives: (1) Developer relations, (2) NFT strategy,  (3) DAO operations, (4) internal and external communications, (5) partnerships and recruiting for $8000 every FC. \n\n## Motivation:\n\nSince my last payout proposal 7 cycles ago, I have:\n\nDAO Operations\n\n\t- Collaborated on the V3 Mitigation Code4rena audit planning and reimbursement proposal [Reimburse Jango $22,500 for Code4rena Audit](https://www.notion.so/eddda75446ae49ed8a5943bfaf67d0b6) \n\nStrategy / Internal comms\n\n\t- Helping supercharge Lexicon Devils FORMING: strategy, comms, partnerships, and funding.\n\n\t- [Planted](https://discord.com/channels/775859454780244028/876252266594721873/1004040297929506878) [seeds](https://discord.com/channels/775859454780244028/1009551855111643207/1009551856332197938) for [Juicenews](http://newsletter.juicebox.money), which @Matthew Brooks and @Brileigh Hardcastle are executing brilliantly\n\nPartnerships and recruiting\n\n- Organized the [BuidlGuidl](https://info.juicebox.money/hackathon/) hackathon with @filipv.eth and friends\n\n- Stewarded integration experiments with C4A, Jokedao, Seed Club, Build Guild, Gitcoin, DeveloperDAO\n\n\t- [@auditfund](https://juicebox.money/@auditfund) - [Fund the NFT Rewards Smart Contract Audit](https://www.notion.so/6bb92c83571245949ecf1e495793e66b) \n\n- Brought some folks into JB ecosystem: Frolic\n\nExternal Comms \n\n\t- Created [Zora](https://info.juicebox.money/blog/juicebox-zora), [Jokedao](https://info.juicebox.money/blog/juicebox-jokedao), and [Thirdweb](https://info.juicebox.money/blog/juicebox-thirdweb) experiments to demonstrate JB integrations with other protocols, and created video + text tutorials\n\n\t- Was a guest on [Into The Bytecode](https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy50cmFuc2lzdG9yLmZtL2ludG8tdGhlLWJ5dGVjb2Rl/episode/M2IxZTJmMDAtM2UwNC00MWE0LTlmYjUtMTI3ZDlmMDQ1NWFj?hl=en-CA&ved=2ahUKEwiqhLf87s76AhV2j2oFHRKNACsQieUEegQIFxAF&ep=6) and [TheDefiant](https://thedefiant.io/juicebox-supercharges-funding-guess-starring-metatope) with @Jango\n\n\t- Memed Juicebox on Twitter: \n\n\t\t- JB+Jokedao hackathons [10,000 impressions](https://twitter.com/nnnnicholas/status/1566942616914169856)\n\n\t\t- Juicebox Dune by @twodam [6000 impressions](https://twitter.com/nnnnicholas/status/1554849624984326144)\n\n\t\t- One-click Snapshot deploy @johnnyD [2700 impressions](https://twitter.com/nnnnicholas/status/1572301239664406533/analytics)\n\n\t\t- Pay with Juicebox @aeolian [1900 impressions](https://twitter.com/nnnnicholas/status/1566636512204263424)\n\n\t\t- Juicenews [1800 impressions](https://twitter.com/nnnnicholas/status/1562786875017945088)\n\n\t\t- NFT Rewards  [2400 impressions](https://twitter.com/nnnnicholas/status/1574532027868925952)\n\n\t\t- veBanny by [jmill.eth](https://www.notion.so/40539e1538894ca9b94ee7fd80b1733b)  [1700 impressions](https://twitter.com/nnnnicholas/status/1552056781601382400)\n\nAncilliary Protocol Development\n\n- NFT Auction project stub with @Viraz Malhotra \n\nDuring the proposed payout period, I intend to focus on\n\n- Developing experiments and ancilliary Juicebox Projects in the vein of [tokenUriResolver](https://github.com/nnnnicholas/juice-tokenUriResolver), [Juicy Treasure](https://juicebox.money/@juicytreasure), [Banny Drawing Contest](https://www.jokedao.io/contest/polygon/0x5165B4a0b7A49601Ec588196B5c83D04E70E58B2/proposal/54631728254390848910948670171458370372955452113640658824175551952258405713378)\n\n- DAO Operations: Audits, town hall, governance & discord varia\n\n- Internal communications: help folks and opportunities meet optimally\n\n- External communications: twitter, JBDAO \n\n- Partnerships and recruiting: project creator and developer relations to recruit talent to JBDAO and as 3rd parties to build atop the protocol.\n\n**The one thing I didn’t do** was revise the terms of engagement, which I said I would do by now in my last proposal. I’m genuinely sorry about this — I should have done it but this renewal snuck up on. @filipv.eth is providing some feedback on improvements to my existing terms and I will be in touch with my company’s law firm this week to move forward on this. I’ll bring something to the DAO and hopefully get some feedback from folks in the DAO.\n\n## Specification:\n\nRetain the $8000 payout to jb.daodevinc.eth from FC33-FC40 inclusive. . This payout should be removed in FC33 unless renewed by proposal.\n\nBy voting to approve this proposal in Snapshot, you are confirming that you have read and agree to the [Terms of Engagement](https://gateway.pinata.cloud/ipfs/QmYpYs1uvRQ9thKsk8PVEekSzka6HtZ24SRVx2fzAgc94T) with _dao dev inc.,_ Nicholas’s employer.\n\n_Terms of Engagement IPFS CID: QmYpYs1uvRQ9thKsk8PVEekSzka6HtZ24SRVx2fzAgc94T_\n\n## Risks:\n\nI do not perform meaningful work during this FC. \n\nI do not follow through with revised terms of engagement.\n"
    },
    "00c407b5afa04134912c55fa0cb758b6": {
        "title": "StudioDAO Function Integration, Legal and Launch Support  grant",
        "url": "/GC33/JBP-275.md",
        "type": "One-Time Payout",
        "status": "Voting",
        "proposalId": "JBP-275",
        "discussionThreadURL": "https://discord.com/channels/775859454780244028/873248745771372584/1027996172410953789",
        "ipfsURL": "https://gateway.pinata.cloud/ipfs/QmcvREzTZDCXE25D1Qcf8vXRA6mHfnTgwyjMK1FcugqGug",
        "voteURL": "https://snapshot.org/#/jbdao.eth/proposal/0x6cb7810a9fc1bce8712cd529e4a11a5d03093312afe93540617be4dce62f192f",
        "date": "2022-10-07",
        "governanceCycle": 33,
        "voteSetup": {
            "choices": [
                ""
            ]
        },
        "body": "# JBP-275 - StudioDAO Function Integration, Legal and Launch Support  grant\n```javascript\nAuthor: kenbot.eth\nDate: (2022-10-07)\n```\n\n## **Synopsis**\n\nThe Juicebox Protocol V3 expands the potential for Juicebox powered projects to develop opinionated interfaces and enables a wider spectrum of use cases for Juicebox based apps.\n\nStudioDAO is an efficient, appealing, full stack use case for JB V3 and NFT Rewards as a coordination protocol for ambitious creative projects.\n\nStudioDAO is an ideal reference project that is ‘Powered by Juicebox’ that brings to reality the immediate potential for user owned networks to become powerful entities.\n\nStudioDAO, U.N.A. (Unincorporated Nonprofit Association) is designed, and operated by StudioDAO, Backlot LLC. but is 100% owned by its members.\n\nThis structure allows us to create a crypto-native DAO with a scoped down governance pipeline that wraps JB V3 into an appealing UX and value prop for filmmakers and fans. And importantly allows the DAO to launch with a true fair drop for this new format of creative collective.\n\nStudioDAO innovates in the following areas to accomplish this:\n\n\t- NFT based membership in StudioDAO, unifying multiple sub-communities across Juicebox entry points\n\n\t- DAO Approval of Juicebox configurations as defined by CSV templates enforces Network rules.\n\n\t- Contractual relationships with Filmmakers that deliver backend participation in community funded films. Revenue is deposited in the U.N.A.’s juicebox and funds the U.N.A.’s Green-light grants, creating a regenerative loop of filmmaking and film distribution revenue.\n\n\t- DAO structure that supports on-chain and IRL activity, with a path to true decentralization.\n\n\t- A carefully defined feature set that supports global participation via NFT Rewards.\n\n\t- StudioDAO is unique in its approach to utilize the Juicebox protocol for long term community development, operation while building the potential for fully autonomous DAOs in the future.\n\n## **Motivation**\n\nStudioDAO’s trajectory as a carefully incubated project is gaining momentum, and is in need of resources to continue to build and launch.\n\nStudioDAO is preparing for launch rapidly after the availability of NFT Rewards. We have completed the design/UX for our MVP at[ ](https://www.figma.com/proto/eB8zIMdEEevyx5bxwMGtIK/%F0%9F%8E%AC-StudioDAO-MVP-Sketches?node-id=510%3A4639&scaling=scale-down-width&page-id=468%3A4030&starting-point-node-id=510%3A4639)\n\n[https://www.figma.com/proto/eB8zIMdEEevyx5bxwMGtIK/🎬-StudioDAO-MVP-Sketches?node-id=510%3A4639&scaling=scale-down-width&page-id=468%3A4030&starting-point-node-id=510%3A4639](https://www.figma.com/proto/eB8zIMdEEevyx5bxwMGtIK/%F0%9F%8E%AC-StudioDAO-MVP-Sketches?node-id=510%3A4639&scaling=scale-down-width&page-id=468%3A4030&starting-point-node-id=510%3A4639)\n\nBacklot will be implementing that for launch in sync with the launch of V3 on Goerli.\n\nThese essential steps have been backed by a prior JBDAO x StudioDAO proposal.\n\n## Next Steps\n\nStudioDAO’s team is planning the next steps to launching a highly integrated app that coordinates filmmakers and fans in a productive, fun, regenerative DAO with multiple reasons to return often and engage.\n\nKey next steps for launch of the DAO include:\n\n- Integrate snapshot voting to allocate regular green-light treasury grants into studiodao.xyz\n\n- Integrate NFT Reward purchase, display and utility into[ studiodao.xyz](http://studiodao.xyz/) and collaborate with Peel to develop a new JB primitive that ALL NFT rewards project owners can use to develop engaged and decentralized communities.\n\n- Complete the connection of real world contractual relationships to our on–chain community and membership\n\n- Expand our on-boarding efforts to test and grow our network effects\n\n- Celebrate our first season filmmakers properly\n\n- Showcase JB V3 and generate excitement with its broad and creative appeal.\n\n## **Specification**\n\nStudioDAO needs support to iterate our MVP, integrate NFT sales and token based governance on site, expand the DAOs first slate of films and begin to manage the value and power of the DAOs green-light treasury.\n\nOur initial output is very efficient and demonstrates the massive latent power of the Juicebox X StudioDAO collaboration\n\nStudioDAO requests an additional $30,000 to elevate our effort and maintain our momentum\n\n\t- 5K for continued Front End development\n\n\t- 5K for continued UX development\n\n\t- 5K to support expanded filmmaker launch slate (current plan is 4 films ready to launch in first 2-4 weeks of operation)\n\n\t- 15K to complete legal contracts development, and financial operations needed to on-board filmmakers responsibly.\n\nIf the proposal passes, JuiceboxDAO will payout $30k to StudioDAO.eth to support these efforts.\n\nAny leftover funds in the treasury after the execution of these steps will be used to support the StudioDAO mission.\n\n## Funding the Green-light treasury\n\nDuring this FC we will plan for a larger proposal that can cold start the expanded slate we anticipate in November.\n\nMany interesting use cases emerge for token driven allocation of treasuries, we will engage the JB DAO broadly in this effort to determine road map and drive towards fully decentralized processes that capitalize on JB V3s expanded capabilities\n\n## **Rationale**\n\nStudioDAO is utilizing Juicebox to create a groundbreaking entertainment experience that empowers film fans like never before.\n\nStudioDAO demonstrates long term, real world value creation and a use case for Juicebox that will onboard 1000s of influential new users including the filmmakers who are ready to bring the DAO to life.\n\n## **Risks**\n\nThis project is complex. Technical, legal, operational or creative issues may limit our ability to execute and successfully launch StudioDAO.\n\n## **Timeline**\n\nNow\n"
    },
    "e56d957309514a37944bdeaa9bf0e03d": {
        "title": "Renew Jango's Recurring Payout",
        "url": "/GC33/JBP-276.md",
        "type": "Recurring Payment",
        "status": "Voting",
        "proposalId": "JBP-276",
        "discussionThreadURL": "https://discord.com/channels/775859454780244028/873248745771372584/1028061881618923590",
        "ipfsURL": "https://gateway.pinata.cloud/ipfs/QmV7iGPAhXMm61t9VAbei9i6qsJFPyxxYS7Cxn51n6b5X4",
        "voteURL": "https://snapshot.org/#/jbdao.eth/proposal/0x341d931bc876c0c58e32ee8969fa8759d06b7c7af790d162738db744b75ae954",
        "date": "2022-10-07",
        "governanceCycle": 33,
        "voteSetup": {
            "choices": [
                ""
            ]
        },
        "body": "# JBP-276 - Renew Jango's Recurring Payout\n```plain text\nAuthor: jango\nDate: 2022-10-07\n```\n\n## Thesis\n\nVersioning strategy work, extensions roll-outs, and JBX strengthening and operational convergence with our v3 treasury are necessary projects. They are delicate however, and  successful implementations are more likely when attended to by folks who have full context of their technical, financial, and social implications. The DAO should renew jango’s recurring payout to continue researching and developing these efforts.\n\n## Motivation\n\nRight now we're at the climax of operational overhead due to versioning stuff. The work now is to reduce it all back down to our v3 treasury, creating stability for developers building projects and extensions, and for the JBX token.\n\n## Specification\n\nContinue payouts of $21k per FC to project #55 from the Juicebox DAO’s v2 treasury until Jango launches a V3 treasury for project #55 and Juicebox DAO has funded its v3 treasury sufficiently (≥$100k) to fulfill this commitment. At that time, Jango will let the bookkeeper know to remove the payout to project #55 from Juicebox DAO’s v2 treasury and add it to the v3 treasury. \n\n## Rationale\n\nJango wants to experiment moving project #55’s main treasury to V3 ASAP.\n\n## Risks\n\nIt’s a lot of money that could be better spent elsewhere, or kept in reserves to spend at later times.\n\n## Timeline\n\nImplement this payout as soon as possible, and remove this payout 90 days from this proposal’s passing.\n"
    },
    "45ed6e69a48949fab8f43c1de1948359": {
        "title": "Update Multisig Membership",
        "url": "/GC33/JBP-277.md",
        "type": "New Multi-Sig Member",
        "status": "Voting",
        "proposalId": "JBP-277",
        "discussionThreadURL": "https://discord.com/channels/775859454780244028/873248745771372584/1028073713394008124",
        "ipfsURL": null,
        "voteURL": null,
        "date": "2022-10-07",
        "governanceCycle": 33,
        "voteSetup": {
            "type": "weighted",
            "choices": [
                "No",
                "Abstain",
                "jmill (0x123a3c28eb9e701c173d3a73412489f3554f3005)",
                "jigglyjams (0x25910143c255828f623786f46fe9a8941b7983bb)",
                "tankbottoms (0x468f178672C86bFA02e5E1B0413C3ccf55A37409)",
                "Viraz (0x2DdA8dc2f67f1eB94b250CaEFAc9De16f70c5A51)",
                "Zhape (0x5706d5ad7a68bf8692bd341234be44ca7bf2f654)",
                "peri (0x63A2368F4B509438ca90186cb1C15156713D5834)",
                "pmoncada (0x679d87d8640e66778c3419d164998e720d7495f6)",
                "Dr. Gorilla (0x6860f1A0cF179eD93ABd3739c7f6c8961A4EEa3c)",
                "jango (0x823b92d6a4b2AED4b15675c7917c9f922ea8ADAD)",
                "Dhyon (0xA0Ba480a2222bB18c010f97144cFb9A687a8c77c)",
                "Austin Griffith (0xAd69cDE6AFB7Ca67BcAbD033962b5D45cfedfb15)",
                "0xBA5ED (0xb045708e396E20071324C1aed2E4CFB90A0764FE)",
                "seanmc (0xc109636a2b47f8b290cc134dd446Fcd7d7e0cC94)",
                "twodam (0xD78285eef93E13D1F96062265b68099C480121b8)",
                "filipv (0xDc6Dd6Bc601448541A4862a91De1B86291839651)",
                "Aeolian (0xE16a238d207B9ac8B419C7A866b0De013c73357B)",
                "mieos (0xe7879a2D05dBA966Fcca34EE9C3F99eEe7eDEFd1)",
                "JohnnyD (0xf0FE43a75Ff248FD2E75D33fa1ebde71c6d1abAd)",
                "Gulan (0xF8284136B169213E4c50cE09f3E1D9A9b484BAea)"
            ]
        },
        "body": "# JBP-277 - Update Multisig Membership\n```plain text\nAuthor: filipv\nDate: 2022-10-07\n```\n\n## Thesis\n\nUpdate the DAO multisig’s membership.\n\n## Motivation\n\nAlthough the multisig has succeeded in executing proposals thus far, the burden on multisig members has increased significantly due to the deployment of Juicebox DAO’s v2 and v3 treasuries. Consequently, the multisig has experienced several “close calls” in recent funding cycles. Further success relies on maintaining highly involved multisig membership.\n\n```plain text\nSigning frequencies for the last 61 transactions:\n(filipv)      0xDc6D...9651                         61\n(Dr. Gorilla) drgorilla.eth, 0x6860...Ea3c          58\n(twodam)      jbx.twodam.eth, 0xD782...21b8         56\n(seanmc)      seanmc.eth, 0xc109...cC94             54\n(johnnyd)     johnnyd.eth, 0xf0FE...abAd            52\n(zeugh)       zeugh.eth, 0xf725...0041              50\n(dhyon)       0xA0Ba...c77c                         46\n(jango)       jango.eth, 0x823b...ADAD              43\n(mieos)       mieos.eth, 0xe787...EFd1              41\n(tankbottoms) 0x468f...7409                         39\n(Peri)        peri.eth, 0x63A2...5834               24\n(aeolian)     aeolian.eth, 0xE16a...357B            17\n(Austin)      jbx.austingriffith.eth, 0xAd69...fb15  4\n(Gulan)       gulan.eth, 0xF828...BAea               3\n(Aaron)       0x352e...2D09                          0\n```\n\n## Specification\n\nConduct a weighted Snapshot vote with the following options:\n\n- No\n\n- Abstain\n\n- 0x123a3c28eb9e701c173d3a73412489f3554f3005 (jmill)\n\n- 0x25910143c255828f623786f46fe9a8941b7983bb (jigglyjams)\n\n- 0x468f178672C86bFA02e5E1B0413C3ccf55A37409 (tankbottoms)\n\n- 0x2DdA8dc2f67f1eB94b250CaEFAc9De16f70c5A51 (Viraz)\n\n- 0x5706d5ad7a68bf8692bd341234be44ca7bf2f654 (Zhape)\n\n- 0x63A2368F4B509438ca90186cb1C15156713D5834 (peri)\n\n- 0x679d87d8640e66778c3419d164998e720d7495f6 (pmoncada)\n\n- 0x6860f1A0cF179eD93ABd3739c7f6c8961A4EEa3c (Dr. Gorilla)\n\n- 0x823b92d6a4b2AED4b15675c7917c9f922ea8ADAD (jango)\n\n- 0xA0Ba480a2222bB18c010f97144cFb9A687a8c77c (Dhyon)\n\n- 0xAd69cDE6AFB7Ca67BcAbD033962b5D45cfedfb15 (Austin Griffith)\n\n- 0xb045708e396E20071324C1aed2E4CFB90A0764FE (0xBA5ED)\n\n- 0xc109636a2b47f8b290cc134dd446Fcd7d7e0cC94 (seanmc)\n\n- 0xD78285eef93E13D1F96062265b68099C480121b8 (twodam)\n\n- 0xDc6Dd6Bc601448541A4862a91De1B86291839651 (filipv)\n\n- 0xE16a238d207B9ac8B419C7A866b0De013c73357B (Aeolian)\n\n- 0xe7879a2D05dBA966Fcca34EE9C3F99eEe7eDEFd1 (mieos)\n\n- 0xf0FE43a75Ff248FD2E75D33fa1ebde71c6d1abAd (JohnnyD)\n\n- 0xF8284136B169213E4c50cE09f3E1D9A9b484BAea (Gulan)\n\nAny vote other than a “no” or an “abstain” will be counted as a “yes” for standard governance purposes. If this proposal passes, multisig ownership will be transferred to the 14 volunteers which receive the most votes. If the proposal passes and fewer than 14 volunteers have received votes, only those who have received votes will be included on the multisig. The threshold shall at all times remain at the lowest possible number greater than the total number of multisig owner accounts times 0.6.\n\nAddresses listed in this proposal are not binding. Prospective multisig signers may designate another address which they prefer to the one listed herein.\n\nNote that current multisig members 0x352e85EC1b6c1D422AD868A2b2f3151ED2B12D09 (Aaron Wright) and 0xf7253A0E87E39d2cD6365919D4a3D56D431D0041 (Zeugh) are not included in this list.\n\n## Rationale\n\nA weighted vote allows for the multisig’s updated makeup to reflect the will of the community.\n\n## Risks\n\nThese individuals may inherit certain risks associated with being on the multisig. There might be many new multisig members. It may take time for them to adapt. Updated configurations will have to be queued quickly to allow for signing. Safe does not allow for the addition or removal of more than one member in a given transaction.\n\n## Timeline\n\nThe multsig’s membership shall be fully updated no later than four weeks after this proposal’s passing.\n"
    }
}